import React, { useState } from "react";
import "./infoModal.styles.scss";

import Paper from "@material-ui/core/Paper";

const InfoModal = (props) => {
  return (
    <Paper>
      <div id="infoModal" className="modal" dir="rtl">
        <div className="modal-dialog modal-lg d-flex justify-content-center">
          <div className="modal-content" dir="rtl">
            <p>
              הצעצועים הטובים ביותר של Lirstoys מעוררים את דמיונו של ילדכם, מעודדים מיומנויות חשיבה ומטפחים יצירתיות.
              ילדים פורחים עם שילוב של צעצועים המטפחים התפתחות באזורים שונים, כולל בובות ודמויות פעולה, המעודדות צעצועי
              דמיון, פעילות גופנית ורכיבה, המטפחות מיומנויות מוטוריות, וצעצועים אלקטרוניים וטאבלטים, המפתחים אוריינות
              דיגיטלית. כמו כן, יש כמה צעצועי נסיעות שאפשר להביא אותם בקלות לטיולים.
            </p>
            <hr />
            <p>
              צעצועים שונים מתאימים לקבוצות גיל שונות. לתינוקות (6 - 12 חודשים) בחר צעצועים הכוללים צבעים בהירים,
              טקסטורות מעניינות וצלילים מהנים והם נקיים מחלקים קטנים ומשוחררים. לפעוטות (שנה - 3) בחרו באופניים וצעצועי
              רכיבה, כדורים, חידות ובלוקים גדולים. ילדים בגיל הרך (3 - 5 שנים) מעוניינים לבנות וליצור, ולכן ערכות בנייה
              וצעצועים לאומנויות ומלאכות עושות בחירות טובות. הם גם אוהבים משחק דמיוני, לכן קחו בחשבון מטבחי משחק, בובות
              תינוקות ובתי בובות. ילדים בגיל בית הספר (5 - 9 שנים) נהנים לרוב ממשחקי לוח, צעצועי ספורט וצעצועים
              אלקטרוניים, כולל לימוד צעצועים. לילדות (9 - 12 שנים), משחקי לוח, אלקטרוניקה, משחקי קלפים ומשחקי ספורט
              מתאימים.
            </p>
            <hr />
            <p>מתמחה במכירת מוצרים בארצות הברית ולא כל המוצרים כרגע נמצאים בישראל LIRS TOYS חשוב לציין</p>
            <hr />
            <p>
              לגו מגנטי 72 חלקים מבית LIRS TOYS עכשיו גם בישראל כיף * יצירתי * חינוכי 72 אריחי בניין מגנטיים עם תיק
              נשיאה לגילאי 3 + 26 ריבועים מגנטיים * * 20 משולשים מגנטיים * * 26 אותיות ABC (לא מגנטי) * * תיבת נשיאה
              מפלסטיק כדי לשמור על כולם יחד זה עובדה- צעצועים LIRS TOYS לגו מגנטי בלוקים מגנטיים אלה יכולים בעצם לשנות
              את הדרך שבה ילדיך חושבים. בנייה עם בלוקים מעוררת יצירתיות ובונה כישורים קריטיים שהם זקוקים להם בחיים. על
              ידי עידוד ילדיך לבנות אתה: מלמדים אותם: פתרון בעיות כישורי שפה ותקשורת גיאומטריה מדע הנדסה עיצוב שיפור
              כישורי מוטוריות עדינים ותיאום עין-יד פיתוח מיומנויות מרחבית יצירת קיבולת לחשיבה יצירתית ומתפצלת כישורים
              חברתיים (כאשר הם משמשים יחד עם ילדים אחרים או בני משפחה) יש גם ראיות כי משחק בלוק מורכב מקושר עם מיומנויות
              מתמטיקה מתקדמות בחיים מאוחרים יותר. מה עוד אפשר לרצות מצעצוע כשילדכם מתחילים לזהות צורות וצבעים ולאט לאט
              מתחיל ליצור מבנים משלהם.לבנות כדור קסם, כוכב, רקטה, בית ועוד... הרבה יותר! אז למה אתם מחכים? הזמינו עכשיו
              לגו מגנטי מבית LIRS TOYS כי על איכות ילדנו לא מתפשרים!
            </p>
            לגו מגנטי 72 חלקים מבית LIRS TOYS עכשיו גם בישראל
            <br />
            כיף * יצירתי * חינוכי
            <br />
            72 אריחי בניין מגנטיים עם תיק נשיאה
            <br />
            לגילאי 3 +
            <br />
            26 ריבועים מגנטיים
            <br />
            <p>* * 20 משולשים מגנטיים</p>
            <br />
            <p>* * 26 אותיות ABC (לא מגנטי)</p>
            <br /> <p>* * תיבת נשיאה מפלסטיק כדי לשמור על כולם יחד זה עובדה- צעצועים LIRS TOYS לגו מגנטי</p>
            <br />{" "}
            <p>
              בלוקים מגנטיים אלה יכולים בעצם לשנות את הדרך שבה ילדיך חושבים. בנייה עם בלוקים מעוררת יצירתיות ובונה
              כישורים קריטיים שהם זקוקים להם בחיים. על ידי עידוד ילדיך לבנות אתה:
            </p>
            <br />
            <p>
              מלמדים אותם:
              <br />
              פתרון בעיות
              <br />
              כישורי שפה ותקשורת
              <br />
              גיאומטריה
              <br />
              מדע
              <br />
              הנדסה
              <br />
              עיצוב
              <br />
              שיפור כישורי מוטוריות עדינים ותיאום עין-יד
              <br />
              פיתוח מיומנויות מרחבית
              <br />
              יצירת קיבולת לחשיבה יצירתית ומתפצלת
              <br />
              כישורים חברתיים (כאשר הם משמשים יחד עם ילדים אחרים או בני משפחה)
              <br />
              יש גם ראיות כי משחק בלוק מורכב מקושר עם מיומנויות מתמטיקה מתקדמות בחיים מאוחרים יותר.
              <br />
            </p>
            <p>
              מה עוד אפשר לרצות מצעצוע כשילדכם מתחילים לזהות צורות וצבעים ולאט לאט מתחיל ליצור מבנים משלהם.לבנות כדור
              קסם, כוכב, רקטה, בית ועוד... הרבה יותר!
            </p>
            <p>אז למה אתם מחכים?</p>
            <p>הזמינו עכשיו לגו מגנטי מבית LIRS TOYS כי על איכות ילדנו לא מתפשרים!</p>
            <hr />
            לגו מגנטי 30 חלקים מבית LIRS TOYS עכשיו הגיע גם לישראל עכשיו יהיה לילדים יותר כיף לשחק עם קבוצת אבני המגנט
            הללו בעת יצירת צורות בסיסיות עם 30 החלקים, כולל כדור קסמים, בית, כוכב, משולש, בניין ועוד ועוד. סט זה מגיע עם
            18 ריבועים (גודל. 2.55 "= 6.45 ס"מ.) ו -12 משולשים (גודל. 2.1" = 5.3 ס"מ )
            <br />
            האריחים המגנטיים עשויים מחומר פלסטי חזק וחסר רעילות (BPA FREE) המאפשר לכם להיות שלוים ולהיות בטוחים שילדיכם
            נהנים בבטחה עם הצעצועים שלהם. ידידותיים לסביבה: כל חלקי צבע הקשת עברו תהליך הידוק כדי למנוע התפרקות
            <br />
            קל לשימוש? - הרכיבים המגנטיים העוצמתיים שלו קלים מאוד להרכבה, ומאפשרים לילדים לחוות גמישות ופשטות תוך שימוש
            במוחם היצירתי לבניית מבנים בכל גודל, ערכות אבני החינוך הטובות ביותר לבנים ולבנות שלכם. אל תתפשרו על שום דבר
            פחות משלמות כשמדובר בילדיכם.
            <hr />
            נוחות ועמידות? אריחים מגנטיים אלה חזקים ובלתי ניתנים לשבירה מכיוון שהם עשויים מחומר איכותי מפלסטיק (ABS
            ORIGINAL) שיימשך שנים רבות, BPA FREE 100% NONTOXIC.
            <hr />
            צעצוע חינוך? - אבני הבניין הללו מניעות דמיון ומלמדות ילדים (בני 3+) - כישורי בעיות שהם הגורם המפתח להצלחה
            בסביבה המשתנה של היום.
            <br />
            אז למה אתם מחכים?
            <br />
            הזמינו עכשיו לגו מגנטי מבית LIRS TOYS כי על איכות ילדנו לא מתפשרים!
          </div>
        </div>
      </div>
    </Paper>
  );
};

export default InfoModal;
